In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [3]:
print(df)

     A      B         C         D
0  foo    one  0.555353  0.249593
1  bar    one -0.059770 -0.115279
2  foo    two -0.538437 -0.493994
3  bar  three  0.542416  0.042324
4  foo    two  0.041066  1.452322
5  bar    two -0.048510  0.869876
6  foo    one -0.250505  0.976857
7  foo  three -0.128273  0.966556

In [4]:
print(df.groupby('A'),type(df.groupby('A')))

<pandas.core.groupby.DataFrameGroupBy object at 0x7f2bee7edb70> <class 'pandas.core.groupby.DataFrameGroupBy'>

In [5]:
a=df.groupby('A').mean()

In [6]:
a

            C         D
A
bar  0.144712  0.265640
foo -0.064159  0.630267

In [7]:
b=df.groupby(['A','B']).mean()

In [8]:
c=df.groupby(['A'])['D'].mean()

In [9]:
c

A
bar    0.265640
foo    0.630267
Name: D, dtype: float64

In [10]:
b

                  C         D
A   B
bar one   -0.059770 -0.115279
    three  0.542416  0.042324
    two   -0.048510  0.869876
foo one    0.152424  0.613225
    three -0.128273  0.966556
    two   -0.248686  0.479164

In [11]:
df1 = pd.DataFrame({'X' : ['A', 'B', 'A', 'B'], 'Y' : [1, 4, 3, 2]})

In [12]:
df1

   X  Y
0  A  1
1  B  4
2  A  3
3  B  2

In [13]:
print(df1.groupby('X'),type(df1.groupby('X')))

<pandas.core.groupby.DataFrameGroupBy object at 0x7f2bee7f9a20> <class 'pandas.core.groupby.DataFrameGroupBy'>

In [14]:
print(list(df1.groupby('X')))

[('A',    X  Y
0  A  1
2  A  3), ('B',    X  Y
1  B  4
3  B  2)]

In [15]:
print(df1.groupby(['X']).groups)

{'A': Int64Index([0, 2], dtype='int64'), 'B': Int64Index([1, 3], dtype='int64')}

In [16]:
print(df1.groupby(['X']).groups['A'])

Int64Index([0, 2], dtype='int64')

In [17]:
print(df1.groupby(['X']).size())

X
A    2
B    2
dtype: int64

In [18]:
s = pd.Series([1, 2, 3, 10, 20, 30], index = [1, 2, 3, 1, 2, 3])

In [19]:
print(s)

1     1
2     2
3     3
1    10
2    20
3    30
dtype: int64

In [20]:
grouped=s.groupby(level=0)

In [21]:
grouped

In [22]:
grouped.groups

{1: Int64Index([1, 1], dtype='int64'),
 2: Int64Index([2, 2], dtype='int64'),
 3: Int64Index([3, 3], dtype='int64')}

In [23]:
grouped.first()

1    1
2    2
3    3
dtype: int64

In [24]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [25]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [26]:
grouped.mean()

1     5.5
2    11.0
3    16.5
dtype: float64

In [27]:
grouped.median()

1     5.5
2    11.0
3    16.5
dtype: float64

In [28]:
grouped.count()

1    2
2    2
3    2
dtype: int64

In [29]:
grouped.std()

1     6.363961
2    12.727922
3    19.091883
dtype: float64

In [30]:
grouped.prod()

1    10
2    40
3    90
dtype: int64

In [31]:
df2 = pd.DataFrame({'a':[1,1,2,2],
                  'b':np.random.rand(4),
                  'c':np.random.rand(4),
                  'd':np.random.rand(4),})

In [32]:
df2

   a         b         c         d
0  1  0.758300  0.293631  0.899304
1  1  0.064901  0.117525  0.063865
2  2  0.713046  0.238742  0.064855
3  2  0.650239  0.281641  0.538080

In [33]:
df2.groupby('a').agg(['mean',np.sum])

          b                   c                   d
       mean       sum      mean       sum      mean       sum
a
1  0.411600  0.823201  0.205578  0.411156  0.481584  0.963169
2  0.681643  1.363285  0.260191  0.520383  0.301468  0.602935